Rails-0-ao-CRUD/app/controllers/tasks_controller.rb

  def create
    @task = Task.new(params.require(:task).permit(:description,
      :status))
    @task.save
---
INSERT INTO "tasks" ("description", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "teste"], ["status", 1], ["created_at", "2022-02-02 04:28:53.137111"], ["updated_at", "2022-02-02 04:28:53.137111"]]

  def update
    @task = Task.find(params[:id])
    @task.update(params.require(:task).permit(:description, :status))
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "Comprar pao2"], ["updated_at", "2022-02-02 04:34:43.824363"], ["id", 1]]